# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
n = [2, 3, 5, 6]
m = []


def summ(x, y):
    if len(x) % 2 == 0:
        for i in range(int(len(x)/2)):
            b = x[i]*x[-i-1]
            y.append(b)
        return y
    else:
        for i in range(int(len(x)/2+1)):
            b = x[i]*x[-i-1]
            y.append(b)
        return y

print(f'произведение пар чисел списка - > {summ(n, m)}')
